ETL/Catalogs/ЗначенияЭталонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ЗначенияЭталонов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>ChartOfCharacteristicTypes.ТипыЭталонов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭталонПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.РеквизитыЭталонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.РеквизитыЭталонов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтрокиПоиска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПоиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/InformationRegisters/УдаленныеЭталоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>УдаленныеЭталоны</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипЭталона</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыЭталонов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГУИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ETL/Catalogs/ЗначенияЭталонов/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		
		
		СтрокаОсновногоПредставления = Реквизиты.Найти(Владелец.ОсновноеПредставление, "Реквизит"); 
		//++ 15.10.2024 Кибернетика Корыткин Изменение формата сохранения наименования
		Если СтрокаОсновногоПредставления <> Неопределено Тогда
			
			Если ТипЗнч(СтрокаОсновногоПредставления.Значение) = Тип("Число") Тогда			
				
				Наименование = Формат(СтрокаОсновногоПредставления.Значение, "ЧДЦ=0; ЧГ=0");
				
			Иначе
				
				Наименование = СтрокаОсновногоПредставления.Значение;
				
			КонецЕсли;
			
		КонецЕсли;	
		//-- 15.10.2024
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭталонПоУмолчанию Тогда
		
		 Запрос = Новый Запрос;
		 
		 Запрос.Текст = "ВЫБРАТЬ
		                |	ЗначенияЭталонов.Ссылка КАК Ссылка
		                |ИЗ
		                |	Справочник.ЗначенияЭталонов КАК ЗначенияЭталонов
		                |ГДЕ
		                |	ЗначенияЭталонов.ЭталонПоУмолчанию
		                |	И ЗначенияЭталонов.Владелец = &ТипЭталона
		                |	И ЗначенияЭталонов.Ссылка <> &Ссылка";
		 
		 
		 Запрос.УстановитьПараметр("Ссылка", Ссылка);
		 Запрос.УстановитьПараметр("ТипЭталона", Владелец);
		 
		 Результат = Запрос.Выполнить();
		 
		 Если Не Результат.Пустой() Тогда
			 
			 Сообщить("Для данного типа эталонных справочников уже задан элемент, который используется по умолчанию");
			 Отказ = Истина;
			 
		 КонецЕсли;
		
	 КонецЕсли;	 
	 
	 Если РодительПоУмолчанию Тогда
		
		 Запрос = Новый Запрос;
		 
		 Запрос.Текст = "ВЫБРАТЬ
		                |	ЗначенияЭталонов.Ссылка КАК Ссылка
		                |ИЗ
		                |	Справочник.ЗначенияЭталонов КАК ЗначенияЭталонов
		                |ГДЕ
		                |	ЗначенияЭталонов.РодительПоУмолчанию
		                |	И ЗначенияЭталонов.Владелец = &ТипЭталона
		                |	И ЗначенияЭталонов.Ссылка <> &Ссылка";
		 
		 
		 Запрос.УстановитьПараметр("Ссылка", Ссылка);
		 Запрос.УстановитьПараметр("ТипЭталона", Владелец);
		 
		 Результат = Запрос.Выполнить();
		 
		 Если Не Результат.Пустой() Тогда
			 
			 Сообщить("Для данного типа эталонных справочников уже задан элемент, который используется по умолчанию");
			 Отказ = Истина;
			 
		 КонецЕсли;
		
	КонецЕсли;	


		
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)

	ИнфоОбУдалении = РегистрыСведений.УдаленныеЭталоны.СоздатьМенеджерЗаписи();
	ИнфоОбУдалении.ГУИД = Ссылка.УникальныйИдентификатор(); 
	ИнфоОбУдалении.ТипЭталона = Ссылка.Владелец;
	ИнфоОбУдалении.Записать();  
	
КонецПроцедуры

#КонецОбласти
